### Terraform Plan - `prod` 환경

<details>
<summary>📋 Plan 결과 보기</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.mgmt[0]: Reading...
module.rds.random_password.master: Refreshing state... [id=none]
module.rds.random_id.secret_suffix: Refreshing state... [id=kT-PSQ]
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_region.current: Reading...
module.s3_phase3[0].data.aws_caller_identity.current: Reading...
aws_ebs_encryption_by_default.enabled: Refreshing state... [id=terraform-20260121052817854900000001]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0a6b557eaa4719c25]
module.eks.aws_iam_role.node_group: Refreshing state... [id=kyeol-prod-eks-node-role]
module.eks.aws_cloudwatch_log_group.containers: Refreshing state... [id=/aws/eks/kyeol-prod-eks/containers]
module.rds.aws_secretsmanager_secret.rds: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:827913617839:secret:kyeol-prod-rds-creds-913f8f49-lautu7]
module.eks.aws_iam_role.cluster: Refreshing state... [id=kyeol-prod-eks-cluster-role]
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_eks_cluster.main: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=827913617839]
module.s3_phase3[0].aws_s3_bucket.media[0]: Refreshing state... [id=kyeol-prod-media]
module.s3_phase3[0].aws_s3_bucket.logs[0]: Refreshing state... [id=kyeol-prod-logs]
module.ecr.aws_ecr_repository.main["storefront"]: Refreshing state... [id=kyeol-prod-storefront]
module.s3_phase3[0].data.aws_caller_identity.current: Read complete after 0s [id=827913617839]
module.ecr.aws_ecr_repository.main["api"]: Refreshing state... [id=kyeol-prod-api]
data.aws_eks_cluster.main: Read complete after 1s [id=kyeol-prod-eks]
module.ecr.aws_ecr_repository.main["dashboard"]: Refreshing state... [id=kyeol-prod-dashboard]
module.rds.aws_db_parameter_group.main: Refreshing state... [id=kyeol-prod-rds-pg16]
module.vpc.data.aws_region.current: Reading...
module.vpc.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_eks_cluster_auth.main: Reading...
data.aws_eks_cluster_auth.main: Read complete after 0s [id=kyeol-prod-eks]
module.eks.aws_iam_role_policy_attachment.node_cni: Refreshing state... [id=kyeol-prod-eks-node-role-20260112033702412300000005]
module.eks.aws_iam_role_policy_attachment.node_worker: Refreshing state... [id=kyeol-prod-eks-node-role-20260112033702702300000007]
module.eks.aws_iam_role_policy_attachment.node_ssm: Refreshing state... [id=kyeol-prod-eks-node-role-20260112033702378100000004]
module.eks.aws_iam_role_policy_attachment.node_ecr: Refreshing state... [id=kyeol-prod-eks-node-role-20260112033702647200000006]
module.eks.aws_iam_role_policy_attachment.node_cloudwatch: Refreshing state... [id=kyeol-prod-eks-node-role/arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy]
module.eks.aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=kyeol-prod-eks-cluster-role-20260112033702138300000003]
module.eks.aws_iam_role_policy_attachment.cluster_vpc_resource_controller: Refreshing state... [id=kyeol-prod-eks-cluster-role-20260112033702097400000002]
module.ecr.aws_ecr_lifecycle_policy.main["dashboard"]: Refreshing state... [id=kyeol-prod-dashboard]
module.ecr.aws_ecr_lifecycle_policy.main["storefront"]: Refreshing state... [id=kyeol-prod-storefront]
module.ecr.aws_ecr_lifecycle_policy.main["api"]: Refreshing state... [id=kyeol-prod-api]
data.terraform_remote_state.mgmt[0]: Read complete after 3s
module.vpc_peering_mgmt[0].data.aws_route_tables.requester: Reading...
module.vpc_peering_mgmt[0].data.aws_route_tables.requester: Read complete after 0s [id=ap-northeast-2]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-084b40988ed914a0a"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-0f469955ce9f75a5b"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-000b539ccd4cb4e50"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-07babae8b6efcdce7"]: Reading...
module.vpc.aws_security_group.alb: Refreshing state... [id=sg-06a40f0dec2973d76]
module.vpc.aws_route_table.app_internet[0]: Refreshing state... [id=rtb-0a892a39a2c348bf2]
module.vpc.aws_route_table.app_payment[0]: Refreshing state... [id=rtb-0c0e6340166514e86]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-084b40988ed914a0a"]: Read complete after 0s [id=rtb-084b40988ed914a0a]
module.eks.aws_security_group.cluster: Refreshing state... [id=sg-02b1f4bfce08a9859]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-07babae8b6efcdce7"]: Read complete after 1s [id=rtb-07babae8b6efcdce7]
module.vpc_peering_mgmt[0].data.aws_route_tables.accepter: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-000b539ccd4cb4e50"]: Read complete after 1s [id=rtb-000b539ccd4cb4e50]
module.vpc.aws_security_group.vpc_endpoints[0]: Refreshing state... [id=sg-0adfeb7fd1e936deb]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-0f469955ce9f75a5b"]: Read complete after 1s [id=rtb-0f469955ce9f75a5b]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0f2a152c1e60e84e4]
module.vpc.aws_subnet.cache_private["a"]: Refreshing state... [id=subnet-0e7e6ab5cdb968e8e]
module.vpc.aws_subnet.cache_private["c"]: Refreshing state... [id=subnet-01d3e91026f00a0b1]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0b6e7b39ea4d83a1d]
module.vpc.aws_security_group.rds[0]: Refreshing state... [id=sg-0ac70011090ebd4a3]
module.vpc.aws_subnet.app_payment["a"]: Refreshing state... [id=subnet-0c9483af4d6fd73c5]
module.vpc_peering_mgmt[0].data.aws_route_tables.accepter: Read complete after 0s [id=ap-northeast-2]
module.vpc.aws_subnet.app_payment["c"]: Refreshing state... [id=subnet-03b83b4f75cde01e9]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-0f856d222d7135fbc]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0582f491aeee650b8]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00515c0773d457da4]
module.vpc.aws_subnet.data_private["c"]: Refreshing state... [id=subnet-0edf64b0662d980fb]
module.vpc.aws_subnet.app_internet["a"]: Refreshing state... [id=subnet-0ffc6a2f2c7aae311]
module.vpc.aws_subnet.app_internet["c"]: Refreshing state... [id=subnet-0a889edc1d81fb413]
module.vpc_peering_mgmt[0].aws_vpc_peering_connection.main: Refreshing state... [id=pcx-0f29388d2f45e61cb]
module.vpc.aws_subnet.data_private["a"]: Refreshing state... [id=subnet-063e9d45be7c1336b]
module.vpc.aws_security_group.cache[0]: Refreshing state... [id=sg-0e1858c5ba13bb9e7]
module.eks.aws_security_group_rule.cluster_egress: Refreshing state... [id=sgrule-3014310909]
module.eks.aws_security_group_rule.cluster_mgmt_ingress[0]: Refreshing state... [id=sgrule-1222247996]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-072bc13ff5916a8aa"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-085a1e864d4e979c3"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0f2a152c1e60e84e4"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0c298d5a34154cb49"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0a892a39a2c348bf2"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0c0e6340166514e86"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-085a1e864d4e979c3"]: Read complete after 1s [id=rtb-085a1e864d4e979c3]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0f2a152c1e60e84e4"]: Read complete after 1s [id=rtb-0f2a152c1e60e84e4]
module.vpc.aws_route.public_internet: Refreshing state... [id=r-rtb-0f2a152c1e60e84e41080289494]
module.vpc.aws_eip.internet[1]: Refreshing state... [id=eipalloc-0f33286884bb2eb63]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-072bc13ff5916a8aa"]: Read complete after 1s [id=rtb-072bc13ff5916a8aa]
module.vpc.aws_eip.internet[0]: Refreshing state... [id=eipalloc-0c75d627c5d9a26d2]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0c298d5a34154cb49"]: Read complete after 1s [id=rtb-0c298d5a34154cb49]
module.vpc.aws_eip.payment[1]: Refreshing state... [id=eipalloc-0d2fd75736c1872b4]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0a892a39a2c348bf2"]: Read complete after 0s [id=rtb-0a892a39a2c348bf2]
module.vpc.aws_eip.payment[0]: Refreshing state... [id=eipalloc-03ed8156c41e2a26c]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0c0e6340166514e86"]: Read complete after 0s [id=rtb-0c0e6340166514e86]
module.vpc.aws_route_table_association.cache_private["c"]: Refreshing state... [id=rtbassoc-07ee0b85a76f3f719]
module.vpc.aws_route_table_association.cache_private["a"]: Refreshing state... [id=rtbassoc-0933f6b50d572b878]
module.vpc.aws_route_table_association.app_payment["c"]: Refreshing state... [id=rtbassoc-0cda72b17f6402748]
module.vpc.aws_route_table_association.app_payment["a"]: Refreshing state... [id=rtbassoc-0cc531f7bd34fcb3e]
module.vpc.aws_vpc_endpoint.s3[0]: Refreshing state... [id=vpce-0dae9c7c548bdfda7]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03da854f18c6a91a6]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02aedd1ff034ac5a0]
module.vpc_peering_mgmt[0].aws_vpc_peering_connection_options.accepter: Refreshing state... [id=pcx-0f29388d2f45e61cb]
module.vpc_peering_mgmt[0].aws_vpc_peering_connection_options.requester: Refreshing state... [id=pcx-0f29388d2f45e61cb]
module.vpc_peering_mgmt[0].aws_route.requester_to_accepter["rtb-000b539ccd4cb4e50"]: Refreshing state... [id=r-rtb-000b539ccd4cb4e50805491791]
module.vpc.aws_route_table_association.app_internet["a"]: Refreshing state... [id=rtbassoc-03ec2ef9edecbc996]
module.vpc.aws_route_table_association.app_internet["c"]: Refreshing state... [id=rtbassoc-0836f54f9e3d35935]
module.vpc.aws_route_table_association.data_private["c"]: Refreshing state... [id=rtbassoc-007ea9c0196f89c1b]
module.vpc.aws_route_table_association.data_private["a"]: Refreshing state... [id=rtbassoc-023507ba78eb3198d]
module.s3_phase3[0].aws_s3_bucket_ownership_controls.logs[0]: Refreshing state... [id=kyeol-prod-logs]
module.s3_phase3[0].aws_s3_bucket_server_side_encryption_configuration.logs[0]: Refreshing state... [id=kyeol-prod-logs]
module.s3_phase3[0].aws_s3_bucket_public_access_block.logs[0]: Refreshing state... [id=kyeol-prod-logs]
module.s3_phase3[0].aws_s3_bucket_policy.logs_tls[0]: Refreshing state... [id=kyeol-prod-logs]
module.s3_phase3[0].aws_s3_bucket_lifecycle_configuration.logs[0]: Refreshing state... [id=kyeol-prod-logs]
module.s3_phase3[0].aws_s3_bucket_versioning.logs[0]: Refreshing state... [id=kyeol-prod-logs]
module.s3_phase3[0].aws_s3_bucket_server_side_encryption_configuration.media[0]: Refreshing state... [id=kyeol-prod-media]
module.s3_phase3[0].aws_s3_bucket_ownership_controls.media[0]: Refreshing state... [id=kyeol-prod-media]
module.s3_phase3[0].aws_s3_bucket_public_access_block.media[0]: Refreshing state... [id=kyeol-prod-media]
module.s3_phase3[0].aws_s3_bucket_policy.media_cloudfront[0]: Refreshing state... [id=kyeol-prod-media]
module.s3_phase3[0].aws_s3_bucket_versioning.media[0]: Refreshing state... [id=kyeol-prod-media]
module.vpc.aws_vpc_endpoint.ecr_dkr[0]: Refreshing state... [id=vpce-0cb90ccace604ae43]
module.vpc.aws_vpc_endpoint.sts[0]: Refreshing state... [id=vpce-0c302cfee1e6fa432]
module.vpc.aws_vpc_endpoint.logs[0]: Refreshing state... [id=vpce-0200ad212c9441368]
module.vpc.aws_vpc_endpoint.ecr_api[0]: Refreshing state... [id=vpce-0b36942c5b94952dd]
module.vpc.aws_nat_gateway.regional[0]: Refreshing state... [id=nat-1d4f6671fa29c9af9]
module.valkey[0].aws_elasticache_subnet_group.main: Refreshing state... [id=kyeol-prod-cache-subnet]
module.vpc.aws_nat_gateway.payment_regional[0]: Refreshing state... [id=nat-1797737a4bbaf2b37]
module.vpc_peering_mgmt[0].aws_route.accepter_to_requester["rtb-0a892a39a2c348bf2"]: Refreshing state... [id=r-rtb-0a892a39a2c348bf21415821702]
module.vpc_peering_mgmt[0].aws_route.accepter_to_requester["rtb-0c0e6340166514e86"]: Refreshing state... [id=r-rtb-0c0e6340166514e861415821702]
module.eks.aws_eks_cluster.main: Refreshing state... [id=kyeol-prod-eks]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=kyeol-prod-rds-subnet-group]
module.vpc.aws_route.app_internet_nat[0]: Refreshing state... [id=r-rtb-0a892a39a2c348bf21080289494]
module.vpc.aws_route.app_payment_nat[0]: Refreshing state... [id=r-rtb-0c0e6340166514e861080289494]
module.eks.aws_eks_node_group.general: Refreshing state... [id=kyeol-prod-eks:kyeol-prod-ng-general]
module.eks.aws_eks_addon.cloudwatch_observability: Refreshing state... [id=kyeol-prod-eks:amazon-cloudwatch-observability]
module.eks.aws_eks_node_group.payment[0]: Refreshing state... [id=kyeol-prod-eks:kyeol-prod-ng-payment]
module.eks.data.tls_certificate.cluster[0]: Reading...
module.rds.aws_db_instance.main: Refreshing state... [id=db-QXFBMV3RZORGBYOGUM7VAY6MDQ]
module.valkey[0].aws_elasticache_replication_group.main: Refreshing state... [id=kyeol-prod-cache]
module.rds.aws_secretsmanager_secret_version.rds: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:827913617839:secret:kyeol-prod-rds-creds-913f8f49-lautu7|terraform-20260113103857241000000002]
module.eks.data.tls_certificate.cluster[0]: Read complete after 0s [id=2f4c12273dfce0668da79492f884c5b681951fb9]
module.eks.aws_iam_openid_connect_provider.cluster[0]: Refreshing state... [id=arn:aws:iam::827913617839:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/D706BE88F36A43CA4F590E9425BA6094]
module.eks.aws_iam_role.fluent_bit[0]: Refreshing state... [id=kyeol-prod-fluent-bit-role]
aws_iam_role.saleor_api: Refreshing state... [id=kyeol-prod-api-role]
module.eks.aws_iam_role.cluster_autoscaler[0]: Refreshing state... [id=kyeol-prod-cluster-autoscaler-role]
module.eks.aws_iam_role.external_dns[0]: Refreshing state... [id=kyeol-prod-external-dns-role]
module.eks.aws_iam_role.alb_controller[0]: Refreshing state... [id=kyeol-prod-alb-controller-role]
aws_iam_role_policy.saleor_api_s3: Refreshing state... [id=kyeol-prod-api-role:kyeol-prod-api-s3-policy]
module.eks.aws_iam_role_policy.fluent_bit[0]: Refreshing state... [id=kyeol-prod-fluent-bit-role:kyeol-prod-fluent-bit-policy]
module.eks.aws_iam_role_policy.external_dns[0]: Refreshing state... [id=kyeol-prod-external-dns-role:kyeol-prod-external-dns-policy]
module.eks.aws_iam_role_policy.cluster_autoscaler[0]: Refreshing state... [id=kyeol-prod-cluster-autoscaler-role:kyeol-prod-cluster-autoscaler-policy]
module.eks.aws_iam_role_policy.alb_controller[0]: Refreshing state... [id=kyeol-prod-alb-controller-role:kyeol-prod-alb-controller-policy]
module.eks.helm_release.cluster_autoscaler[0]: Refreshing state... [id=cluster-autoscaler]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.vpc.aws_network_acl.payment[0] will be created
  + resource "aws_network_acl" "payment" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + region     = "ap-northeast-2"
      + subnet_ids = [
          + "subnet-03b83b4f75cde01e9",
          + "subnet-0c9483af4d6fd73c5",
        ]
      + tags       = {
          + "CostCenter"  = "production"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kyeol-prod-nacl-payment"
          + "Project"     = "kyeol"
          + "Purpose"     = "Payment Gateway Isolation"
          + "Team"        = "msp-team3"
        }
      + tags_all   = {
          + "CostCenter"  = "production"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kyeol-prod-nacl-payment"
          + "Project"     = "kyeol"
          + "Purpose"     = "Payment Gateway Isolation"
          + "Team"        = "msp-team3"
        }
      + vpc_id     = "vpc-0a6b557eaa4719c25"
    }

  # module.vpc.aws_network_acl_rule.payment_inbound_ephemeral[0] will be created
  + resource "aws_network_acl_rule" "payment_inbound_ephemeral" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + region         = "ap-northeast-2"
      + rule_action    = "allow"
      + rule_number    = 200
      + to_port        = 65535
    }

  # module.vpc.aws_network_acl_rule.payment_inbound_vpc[0] will be created
  + resource "aws_network_acl_rule" "payment_inbound_vpc" {
      + cidr_block     = "10.30.0.0/16"
      + egress         = false
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + region         = "ap-northeast-2"
      + rule_action    = "allow"
      + rule_number    = 100
    }

  # module.vpc.aws_network_acl_rule.payment_outbound_https[0] will be created
  + resource "aws_network_acl_rule" "payment_outbound_https" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "tcp"
      + region         = "ap-northeast-2"
      + rule_action    = "allow"
      + rule_number    = 200
      + to_port        = 443
    }

  # module.vpc.aws_network_acl_rule.payment_outbound_vpc[0] will be created
  + resource "aws_network_acl_rule" "payment_outbound_vpc" {
      + cidr_block     = "10.30.0.0/16"
      + egress         = true
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + region         = "ap-northeast-2"
      + rule_action    = "allow"
      + rule_number    = 100
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on ../../modules/eks/cluster_autoscaler_helm.tf line 27, in resource "helm_release" "cluster_autoscaler":
  27:     value = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 12 more similar warnings elsewhere)

Error: Kubernetes cluster unreachable: the server has asked for the client to provide credentials

  with module.eks.helm_release.cluster_autoscaler[0],
  on ../../modules/eks/cluster_autoscaler_helm.tf line 7, in resource "helm_release" "cluster_autoscaler":
   7: resource "helm_release" "cluster_autoscaler" {


```

</details>

**변경관리 추적 링크:** [Actions Run #25](https://github.com/MSP-Team3/kyeol-infra-terraform/actions/runs/21199384103)
